export default {
  vxe: {
    base: {
      pleaseInput: ' كىرگۈزۈڭ',
      pleaseSelect: 'تاللاڭ',
      comma: '，',
      fullStop: '。'
    },
    loading: {
      text: 'يۈكلىنىۋاتىدۇ...'
    },
    error: {
      downErr: 'چۈشۈرۈش مەغلۇپ بولدى',
      errLargeData: '当绑定的数据量过大时，应该请使用 {0}，否则可能会出现卡顿',
      groupFixed: 'ئەگەر گۇرۇپپا ئۇچۇر بىشىنى ئىشلەتكەن بولسىڭىز،توڭلاتماقچى بولغان قۇر چوقۇم گۇرۇپپا بويىچە تەڭشىلىشى كىرەك',
      groupMouseRange: 'گۇرۇپپا بىشى بىلەن "{0}" نى بىللە ئىشلىتىشكە بولمايدۇ，بۇ بەلكىم خاتالىق كەلتۈرۈپ چىقىرىشى مومكىن',
      groupTag: 'گۇرۇپپا قۇر بىشىغا چوقۇم  "{0}" نى ئىشلىتىشىڭىز كىرەك،ھەرگىزمۇ "{1}"نى ئەمەس ،بولمىسا بۇ بەلكىم خاتالىق كەلتۈرۈپ چىقىرىشى مومكىن',
      scrollErrProp: 'مەۋھۇم يۇمىلاتما ئىقىدارىنى قوزغاتقاندىن كىيىن بۇ سېپىرنى تەكشەشكە بولمايدۇ "{0}"',
      errConflicts: 'سان سىپىر "{0}" بىلەن "{1}" دە ماسلاشماسلىق ئەھۋالى مەۋجۇت',
      unableInsert: 'بىكىتىلگەن ئورۇنغا قىستۇرۇشقا بولمايدۇ، پارامېتىرىڭىزنىڭ توغرا-خاتالىقىنى تەكشۈرۈڭ ',
      useErr: 'قاچىلاش: "{0}" پارچىنى قاچىلىغاندا خاتالىق كۆرۈلدى ،بەلكىم رەت تەرتىۋىدە بىنۇرماللىق كۆرۈلگەن بولۇشى مومكىن，مۇناسىۋەتلىك پارچە چوقۇم  Table دىن ئاۋۋال قاچىلىنىشى كىرەك',
      barUnableLink: 'ئەسۋاب ئىستونى جەدىۋەل بىلەن ئۇلىنىشقا ئامالسىز',
      expandContent: 'ئىچىلغان قۇردىكى قىستۇرما ئەسلىي "content"،بولۇشى كىرەك ،سېلىشتۇرۇپ قايتا سىناڭ',
      reqComp: 'كەم "{0}" گۇرۇپپا ھۆججىتى，قاچىلانغان ياكى قاچىلانمىغانلىقىنى تەكشۈرۈڭ。 https://vxeui.com/#/start/useGlobal',
      reqModule: 'كەم "{0}" كود يازمىسى',
      reqProp: 'كىرەكلىك بولغان  "{0}" پارامېتىر كەم،بۇ بەلكىم خاتالىق كەلتۈرۈپ چىقىرىشى مومكىن',
      emptyProp: 'پارامېتىر "{0}" قۇرۇق بولسا بولمايدۇ',
      errProp: 'قوللىمايدىغان پارامېتىر "{0}"，سىزگە لازىملىقى بەلكىم بۇ بولىشى مومكىن "{1}"',
      colRepet: 'column.{0}="{1}" تەكرار بوپ قالدى، بۇ بەلكىم مەلۇم ئىقدارنى نۇرمال ئىشلىتىشىڭىزگە تەسىر يەتكۈزۈشى مومكىن',
      notFunc: 'ئۇسۇل "{0}" مەۋجۇت ئەمەس',
      errFunc: 'پارامېتىر "{0}" ئۆلچەملىك ئۇسۇل ئەمەس',
      notValidators: 'ئومومىيۈزلۈك دەلىللەشتە "{0}" مەۋجۇت ئەمەس',
      notFormats: 'ئومومىيۈزلۈك فورماتلاشتا "{0}" مەۋجۇت ئەمەس',
      notCommands: 'ئومومىيۈزلۈك بۇيرۇق "{0}" مەۋجۇت ئەمەس',
      notSlot: 'قىستۇرما "{0}" مەۋجۇت ئەمەس',
      noTree: 'دەرەخ شەكىللىك  قوللىمايدىغان قۇرۇلما "{0}"',
      notProp: 'قوللىمايدىغان پارامېتىر "{0}"',
      checkProp: 'ئۇچۇر مىقدارى كۆپ بوپ كەتكەندە بەلكىم تاللاش كۇنۇپكىسى قىتىۋىلىشى مومكىن ،تەۋسىيەلىك تەكشەشكە تېگىشلىك پارامېتىر "{0}" بەت قۇرۇلمىسىنى ئەلالاشتۇرىدۇ',
      coverProp: '"{0}" نىڭ پارامېتىرى "{1}" قايتىلانما قىممەت بىرىلدى، بەلكىم خاتالىق كەلتۈرۈپ چىقىرىشى مومكىن',
      uniField: 'سۆز بولىكى  "{0}" قايتىلانما قىممەت بىرىلدى، بۇ بەلكىم خاتالىق كەلتۈرۈپ چىقىرىشى مومكىن',
      repeatKey: 'ئاچقۇچلىق پارامېتىر قايتىلانما {0}="{1}" بۇ بەلكىم خاتالىق كەلتۈرۈپ چىقىرىشى مومكىن',
      delFunc: 'ئۇسۇل "{0}" تاشلىۋىتىلدى،تەۋسىيەلىك تولۇقلانما ئۇسۇل "{1}"',
      delProp: 'پارامېتىر "{0}" تاشلىۋىتىلدى،تەۋسىيەلىك پارامېتىر "{1}"',
      delEvent: 'ھەرىكەت "{0}" تاشلىۋىتىلدى،تەۋسىيەلىك ھەرىكەت "{1}"',
      removeProp: 'پارامېتىر "{0}" تاشلىۋىتىلدى،ئىشلەتمەڭ بۇ بەلكىم خاتالىق كەلتۈرۈپ چىقىرىشى مومكىن',
      errFormat: 'ئومومىيۈزلۈك فورماتلاشتا  "VXETable.formats" نى ئىشلىتىڭ،ئىنىقلىما،يۈكلەنمىگە "formatter={0}" نىڭ ئۇسۇلىنى ئىشلىتىش تەۋسىيە قىلىنمايدۇ',
      notType: 'قوللىمايدىغان ھۆججەت شەكلى "{0}"',
      notExp: 'بۇ تور كۆرگۈچ ئەكىرىش/ئاچىقىشنى قوللىمايدۇ',
      impFields: 'ئەكىرىشى مەغلۇپ بولدى،سۆز ھەم ئۇچۇر فورماتىنى تەكشۈرۈڭ',
      treeNotImp: 'دەرەخ شەكىللىك جەدىۋەلنى ئەكىرىشنى قوللىمايدۇ',
      treeCrossDrag: '只能拖拽第一层级',
      treeDragChild: '父级不能拖拽到自己的子级中',
      reqPlugin: '可选扩展插件 "{1}" https://vxeui.com/other{0}/#/{1}/install'
    },
    table: {
      emptyText: 'ھازىرچە ئۇچۇر يوق',
      allTitle: 'ھەممىنى تاللاش/قالدۇرۇش',
      seqTitle: 'تەرتىپ',
      actionTitle: 'مەشخۇلات',
      confirmFilter: 'تاسقاش',
      resetFilter: 'ئەسلىگە كەلتۈرۈش',
      allFilter: 'بارلىق',
      sortAsc: 'ئۆرلەش،كىچىكتىن-چوڭغا',
      sortDesc: 'پەسىيىش، چوڭدىن -كىچىككە',
      filter: 'تاللانغان قۇرغا تاسقاش ئىقتىدارىنى قوزغىتىش',
      impSuccess: 'ئەكىرىش ئوڭۇشلۇق بولدى {0} تال ئۇچۇر ',
      expLoading: 'چىقرىۋاتىدۇ',
      expSuccess: 'چىقىرىش ئوڭۇشلۇق بولدى',
      expError: 'چىقىرىش مەغلۇپ بولدى',
      expFilename: 'چىقىرىش_{0}',
      expOriginFilename: 'چىقىرىش_مەنبەسى_{0}',
      customTitle: 'قور تەڭشىكى',
      customAll: 'بارلىق',
      customConfirm: 'جەزىملەش',
      customClose: 'تاقاش',
      customCancel: 'ئەمەلدىن قالدۇرۇش',
      customRestore: 'ئەسلىگە قايتۇرۇش',
      maxFixedCol: 'توڭلىتىشقا بولىدىغان ئەڭ چوڭ قۇر سانى  {0} دانە',
      dragTip: 'يۆتكەش：{0}',
      resizeColTip: '宽：{0} 像素',
      resizeRowTip: '高：{0} 像素'
    },
    grid: {
      selectOneRecord: 'كەم بولغاندا بىر تال ئۇچۇر تاللاڭ',
      deleteSelectRecord: 'سىز تاللانغان ئۇچۇرنى ئۆچۈرۈشنى جەزىملەشتۈرەمسىز؟',
      removeSelectRecord: 'سىز تاللانغان ئۇچۇرنى چىقىرىۋىتىشنى جەزىملەشتۈرەمسىز؟',
      dataUnchanged: 'ئۇچۇر ئەسلىي ھالىتىدە!',
      delSuccess: 'تاللانغان ئۇچۇرلار ئوڭۇشلۇق ئۆچۈرۈلدى',
      saveSuccess: 'ساقلاش ئوڭۇشلۇق بولدى',
      operError: 'خاتالىق كۆرۈلدى،مەشخۇلات مەغلۇپ بولدى'
    },
    select: {
      search: 'ئىزدەش',
      loadingText: 'يۈكلىنىۋاتىدۇ',
      emptyText: 'ھازىرچە ئۇچۇر يوق'
    },
    pager: {
      goto: 'ئالغا',
      gotoTitle: 'بەت سانى',
      pagesize: '{0}تال/بەت',
      total: 'جەمئىي {0} دەنە ئۇچۇر',
      pageClassifier: 'بەت',
      homePage: 'باشبەت',
      homePageTitle: 'باشبەت',
      prevPage: 'ئالدىنقى بەت',
      prevPageTitle: 'ئالدىنقى بەت',
      nextPage: 'كىيىنكى بەت',
      nextPageTitle: 'كىيىنكى بەت',
      prevJump: 'ئالدىغا بەت ئاتلاش',
      prevJumpTitle: 'ئالدىغا بەت ئاتلاش',
      nextJump: 'كەينىگە بەت ئاتلاش',
      nextJumpTitle: 'كەينىگە بەت ئاتلاش',
      endPage: 'ئاخرىقى بەت',
      endPageTitle: 'ئاخرىقى بەت'
    },
    alert: {
      title: 'سېستىما ئەسكەرتىشى'
    },
    button: {
      confirm: 'جەزىملەش',
      cancel: 'ئەمەلدىن قالدۇرۇش'
    },
    filter: {
      search: 'ئىزدەش'
    },
    custom: {
      cstmTitle: 'قۇر تەڭشىكى',
      cstmRestore: 'ئەسلىگە قايتۇرۇش',
      cstmCancel: 'ئەمەلدىن قالدۇرۇش',
      cstmConfirm: 'جەزىملەش',
      cstmConfirmRestore: 'سىز راسلا ئەسلىي قور تەكشەك ھالىتىگە قايتۇرامسىز؟',
      cstmDragTarget: 'يۆتكەش：{0}',
      setting: {
        colSort: 'تەرتىپلەش',
        sortHelpTip: 'بىسىپ ياكى سىنبەلگىنى تارتسىڭىز قۇرنى تەرتىپلىيەلەيسىز ',
        colTitle: '列标题',
        colResizable: 'قۇر كەڭلىڭى(پېكسىل)',
        colVisible: 'كۆرۈنەمدۇ-كۆرۈنمەمدۇ',
        colFixed: 'قۇرنى توڭلىتىش',
        colFixedMax: 'قۇر توڭلىتىش（ئەڭ كۆپ بولغاندا {0} قۇر）',
        fixedLeft: 'سول يان',
        fixedUnset: 'تەڭشىمەيمەن',
        fixedRight: 'ئوڭ يان'
      }
    },
    import: {
      modes: {
        covering: 'قاپلاش ئۇسۇلى(بىۋاستە جەدىۋەل ئۇچۇرىنى قاپلاش)',
        insert: 'ئاستىغا ئۇلاپ قوشۇش（جەدۋەل ئاستىغا ئۇلاپ ئۇچۇر قوشۇش）',
        insertTop: 'ئۈستىگە ئۇلاپ قوشۇش（جەدۋەل ئۈستىگە ئۇلاپ ئۇچۇر قوشۇش）',
        insertBottom: 'ئاستىغا ئۇلاپ قوشۇش（جەدۋەل ئاستىغا ئۇلاپ ئۇچۇر قوشۇش）'
      },
      impTitle: 'ئۇچۇر ئەكىرىش',
      impFile: 'ھۆججەت نامى',
      impSelect: 'ھۆججەت تاللاڭ',
      impType: 'ھۆججەت تۈرى',
      impOpts: 'پارامېتىر تەڭشەش',
      impMode: 'ئەكىرىش ھالىتى',
      impConfirm: 'ئەكىرىش',
      impCancel: 'ئەمەلدىن قالدۇرۇش'
    },
    export: {
      types: {
        csv: 'CSV (پەش بىلەن ئايرىلىدۇ)(*.csv)',
        html: 'تور بەت(*.html)',
        xml: 'XML ئۇچۇرى(*.xml)',
        txt: 'يازما ھۆججەت(ھۆججەت تۈرى بىلەن ئايرىلىدۇ)(*.txt)',
        xls: 'Excel 97-2003 خىزمەت خاتىرىسى(*.xls)',
        xlsx: 'Excel خىزمەت خاتىرىسى(*.xlsx)',
        pdf: 'PDF (*.pdf)'
      },
      modes: {
        current: 'ھازىرقى ئۇچۇر(نۆۋەتتىكى بەتتىكى ئۇچۇر)',
        selected: 'تاللانغان ئۇچۇر(نۆۋەتتىكى بەتتىكى بارلىق تاللانغان ئۇچۇر)',
        all: 'بارلىق ئۇچۇر(بارلىق بەتكە ئايرىلغان ئۇچۇرلارنى ئۆز ئىچىگە ئالىدۇ)'
      },
      printTitle: 'ئۇچۇر نۇسخلاش(دايىن)',
      expTitle: 'ئۇچۇر چىقىرىش',
      expName: 'ھۆججەت نامى',
      expNamePlaceholder: 'ھۆججەت نامىنى كىرگۈزۈڭ',
      expSheetName: 'تېما',
      expSheetNamePlaceholder: 'تېمىنى كىرگۈزۈڭ',
      expType: 'ساقلاش تېپى',
      expMode: 'ئۇچۇر تاللاش',
      expCurrentColumn: 'بارلىق سۆز بۆلەك',
      expColumn: 'سۆز بولىكىنى تاللاش',
      expOpts: 'پارامېتىر تەڭشەش',
      expOptHeader: 'ھۆججەت بىشى',
      expHeaderTitle: 'ھۆججەت بىشى لازىممۇ؟',
      expOptFooter: 'ھۆججەت ئاخىرى',
      expFooterTitle: 'ھۆججەت ئاخىرى لازىممۇ؟',
      expOptColgroup: 'ھۆججەت بىشىنى گۇرۇپپىلاش',
      expColgroupTitle: 'ئەگەر مەۋجۇت بولسا،گۇرۇپپىلانغان ھۆججەت بىشى قۇرۇلمىسىنى قوللايدۇ ',
      expOptMerge: 'بېرىكتۈرۈش',
      expMergeTitle: 'ئەگەر مەۋجۇت بولسا برىكتۈرۈلگەن قۇرۇلمىلىق ھۆججەت ئىلمىنتىنى قوللايدۇ ',
      expOptAllExpand: 'دەرىجىسىنى ئىچىش',
      expAllExpandTitle: 'ئەگەر مەۋجۇت بولسا،دەرىجىسى بولغان بارلىق ئۇچۇرلار ئىچىلىدۇ ',
      expOptUseStyle: 'نۇسخا',
      expUseStyleTitle: 'ئەگەر مەۋجۇت بولسا ،نۇسخىسى بولغان ئىلمىنىتلارغا نۇسخا قوشىلىدۇ',
      expOptOriginal: 'ئەسلىي ئۇچۇر',
      expOriginalTitle: 'ئەگەر ئەسلي ئۇچۇر بولسا،جەدۋالگە ئەكىرىشكە بولىدۇ',
      expPrint: 'نۇسخىلاش(نۇسخىلاش)',
      expConfirm: 'چىقىرىش',
      expCancel: 'ئەمەلدىن قالدۇرۇش'
    },
    modal: {
      errTitle: 'خاتالىق ئەسكەرتمىسى',
      zoomMin: 'چوڭايتىش',
      zoomIn: 'كىچىكلىتىش',
      zoomOut: 'ئەسلىي ھالەت',
      close: 'تاقاش',
      miniMaxSize: 'كىچىكلىتىلگەن كۆزنەكنىڭ سانى {0} دانىدىن ئىشىپ كەتسە بولمايدۇ',
      footPropErr: 'show-footer پەقەتلا جەدۋەل ئاخىرىنى ئىچىشقا ئىشلىتىلىدۇ，بىلەن بىرلەشتۈرۈپ show-confirm-button | show-cancel-button | قىستۇرما قىلىپ ئىشلىتىڭ'
    },
    drawer: {
      close: 'تاقاش'
    },
    form: {
      folding: 'يىغىش',
      unfolding: 'يېيىش'
    },
    toolbar: {
      import: 'ئەكرىش',
      export: 'چىقىرىش',
      print: 'نۇسخلاش',
      refresh: 'يىڭىلاش',
      zoomIn: 'پۈتۈن ئىكران',
      zoomOut: 'ئەسلىي ھالەت',
      custom: 'قۇر تەڭشىكى',
      customAll: 'بارلىق',
      customConfirm: 'جەزىملەش',
      customRestore: 'قايتا ئۇرۇنلاشتۇرۇش',
      fixedLeft: 'سول ياندا توڭلىتىش',
      fixedRight: 'ئوڭ ياندا توڭلىتىش',
      cancelFixed: 'قۇر توڭلىتىشنى ئەمەلدىن قالدۇرۇش'
    },
    input: {
      date: {
        m1: '01 ئاي',
        m2: '02 ئاي',
        m3: '03 ئاي',
        m4: '04 ئاي',
        m5: '05 ئاي',
        m6: '06 ئاي',
        m7: '07 ئاي',
        m8: '08 ئاي',
        m9: '09 ئاي',
        m10: '10 ئاي',
        m11: '11 ئاي',
        m12: '12 ئاي',
        quarterLabel: '{0} يىل',
        monthLabel: '{0} يىل',
        dayLabel: '{0} يىل {1}',
        labelFormat: {
          date: 'yyyy-MM-dd',
          time: 'HH:mm:ss',
          datetime: 'yyyy-MM-dd HH:mm:ss',
          week: 'yyyy يىلىنىڭ  WW ھەپتىسى',
          month: 'yyyy-MM',
          quarter: 'yyyy يىلىنىڭ q پەسلى',
          year: 'yyyy'
        },
        weeks: {
          w: 'ھەپتە',
          w0: 'يەكشەنبە',
          w1: 'دۈشەنبە',
          w2: 'سەيشەنبە',
          w3: 'چارشەنبە',
          w4: 'پەيشەنبە',
          w5: 'جۈمە',
          w6: 'شەنبە'
        },
        months: {
          m0: 'يانۋار',
          m1: 'فېۋرال',
          m2: 'مارت',
          m3: 'ئاپىرېل',
          m4: 'ماي',
          m5: 'ئىيۇن',
          m6: 'ئىيۇل',
          m7: 'ئاۋغۇست',
          m8: 'سېنتەبىر',
          m9: 'ئۆتەبىر',
          m10: 'نويابىر',
          m11: 'دېكابىر'
        },
        quarters: {
          q1: 'ئەتىياز',
          q2: 'ياز',
          q3: 'كۈز',
          q4: 'قىش'
        }
      }
    },
    numberInput: {
      currencySymbol: '$'
    },
    imagePreview: {
      popupTitle: 'كۆرۈش',
      operBtn: {
        zoomOut: 'كىچىكلىتىش',
        zoomIn: 'چوڭايتىش',
        pctFull: 'بىردەك كىچىلىتىش',
        pct11: 'ئەسلىي چوڭلۇقى بىلەن كۆرسىتىش',
        rotateLeft: 'سولغا ئايلاندۇرۇش',
        rotateRight: 'ئوڭغا ئايلاندۇرۇش',
        print: 'رەسىمنى بىسىپ نۇسخىلاش',
        download: 'رەسىمنى بىسىپ چۈشۈرۈش'
      }
    },
    upload: {
      fileBtnText: 'بىسىپ ياكى تارتىپ چىقىرىڭ',
      imgBtnText: 'بىسىپ ياكى تارتىپ چىقىرىڭ',
      dragPlaceholder: 'ھۆججەتنى تارتىپ بۇ رايۇنغا قويسىڭىز چىقىرالايسىز ',
      imgSizeHint: 'پارچە {0}',
      imgCountHint: 'ئەڭ كۆپ {0} پارچە',
      fileTypeHint: 'قوللايدۇ {0} ھۆججەت تىپى',
      fileSizeHint: 'يالغۇز ھۆججەت چوڭ-كىچىكلىكى {0}',
      fileCountHint: 'ئەڭ كۆپ بولغان چىقىرىشقا بولىدىغان ھۆججەت سانى {0} پارچە',
      uploadTypeErr: '文件类型不匹配！',
      overCountErr: 'ئەڭ كۆپ تاللاشقا بولىدىغان ھۆججەت سانى{0} پارچە',
      overCountExtraErr: 'ئەڭ كۆپ چەك {0}دانە ，ئارتىپ كەتكەن {1} دانە ھۆججەت قالدۇرۇلدى ',
      overSizeErr: 'ھۆججەت چوڭ-كىچىكلىكى {0}！',
      reUpload: 'قايتا چىقىرىڭ',
      uploadProgress: 'يوللىنىۋاتىدۇ {0}%',
      uploadErr: 'چىقىرىش مەغلۇپ بولدى',
      uploadSuccess: 'چىقىرىش ئوڭۇشلۇق بولدى',
      moreBtnText: 'تىخىمۇ كۆپ（{0}）',
      viewItemTitle: 'بىسىپ كۆرۈڭ',
      morePopup: {
        readTitle: 'توپلامنى كۆرۈش',
        imageTitle: 'رەسىم چىقىرىش',
        fileTitle: 'ھۆججەت چىقىرىش'
      }
    },
    empty: {
      defText: 'ھازىرچە ئۇچۇر يوق'
    },
    colorPicker: {
      clear: '清除',
      confirm: '确认',
      copySuccess: '已复制到剪贴板：{0}'
    },
    formDesign: {
      formName: 'جەدۋەل ئىسمى',
      defFormTitle: 'نام قويۇلمىغان جەدىۋەل',
      widgetPropTab: 'كونتروللاش تۈرلىرى',
      widgetFormTab: 'جەدۋەل تۈرلىرى',
      error: {
        wdFormUni: 'بۇ كونتىروللاش تۈرىدىن جەدۋەلگە پەقەت بىرىنىلا قوشۇشقا بولىدۇ',
        wdSubUni: 'بۇ تىپتىكى كونتىروللاش تۈرىدىن جەدۋەلگە پەقەت بىرىنىلا قوشۇشقا بولىدۇ'
      },
      styleSetting: {
        btn: 'نۇسخا تەڭشىكى',
        title: 'ئۇچۇر نۇسخا تەڭشىكى',
        layoutTitle: 'كونتىروللىغۇچ ئورۇنلاشتۇرۇش',
        verticalLayout: 'ئاستى -ئۈستى ئورۇنلاشتۇرۇش',
        horizontalLayout: 'يانتۇ ئورۇنلاشتۇرۇش',
        styleTitle: 'تېما نۇسخىسى',
        boldTitle: 'قېنىق تېما',
        fontBold: 'قېنىقلاش',
        fontNormal: 'نۇرمال',
        colonTitle: 'پەشنى كۆرسىتىش',
        colonVisible: 'كۆرسىتىش',
        colonHidden: 'يوشۇرۇش',
        alignTitle: 'توغرىلاش ئۇسۇلى',
        widthTitle: 'تېما كەڭلىكى',
        alignLeft: 'سولغا توغرىلاش',
        alignRight: 'ئوڭغا توغرىلاش',
        unitPx: 'پېكسىل',
        unitPct: 'پىرسەنت'
      },
      widget: {
        group: {
          base: 'ئاساسىي كونتروللىغۇچ',
          layout: 'قۇرۇلما كونتروللىغۇچ',
          system: 'سېستىما كونتروللىغۇچ',
          module: 'پارچە كونتروللىغۇچ',
          chart: 'رەسىم كونتروللىغۇچ',
          advanced: 'ئالىي كونتروللىغۇچ'
        },
        copyTitle: 'نۇسخا_{0}',
        component: {
          input: 'كىرگۈزۈش رامكىسى',
          textarea: 'تېكىست رايۇنى',
          select: 'ئاستىغا تارتىپ تاللاش',
          row: 'بىر قۇر كۆپ قاتار',
          title: 'تېما',
          text: 'تېكىست',
          subtable: 'بالا جەدىۋەل',
          VxeSwitch: 'ھەئە/ياق',
          VxeInput: 'كىرگۈزۈش رامكىسى',
          VxeNumberInput: 'سان',
          VxeDatePicker: 'چېسلا',
          VxeTextarea: 'تېكىست رايۇنى',
          VxeSelect: 'ئاستىغا تارتىپ تاللاش',
          VxeTreeSelect: ' دەرەخ شەكىللىك تاللاش',
          VxeRadioGroup: 'تاق تاللاش رامكىسى',
          VxeCheckboxGroup: 'كۆپ تاللاش رامكىسى',
          VxeUploadFile: 'ھۆججەت',
          VxeUploadImage: 'رەسىم',
          VxeRate: 'باھا نۇمۇرى',
          VxeSlider: 'سېيرىلما'
        }
      },
      widgetProp: {
        name: 'كونتروللىغۇچ نامى',
        placeholder: 'ئەسكەرىتمە سۆز',
        required: 'چوقۇم تولدۇرىدىغان دەلىللەش',
        multiple: 'كۆپ تاللاشقا بولىدۇ',
        displaySetting: {
          name: 'تەڭشەكنى كۆرسىتىش',
          pc: 'كومپىيۇتىر نۇسخىسى',
          mobile: 'يانفۇن نۇسخىسى',
          visible: 'كۆرسىتىش',
          hidden: 'يوشۇرۇش'
        },
        dataSource: {
          name: 'ئۇچۇر مەنبەسى',
          defValue: 'تاللاش{0}',
          addOption: 'تاللىغۇچ قوشۇش',
          batchEditOption: 'كۆپ تەھرىرلەش',
          batchEditTip: 'ھەر بىر قۇر بىر تۈرگە توغرا كىلىدۇ،سىز ھەرخىل جەدىۋەل 、Excel、WPS قاتارلىقلاردىن ئۇچۇرلانى نۇسخىلاپ ئەكىلىپ چاپلاپ ئىشلەتسىڭىز بولىدۇ',
          batchEditSubTip: 'ھەر بىر قۇر بىر تۈر،ئەگرر گۇرۇپپا بولسا بالا ئەزاسى قۇرۇق بولسا بولىدۇ سىز Excel、WPS قاتارلىقلاردىن ئۇچۇرلارنى نۇسخىلاپ ئەكىلىپ چاپلاپ ئىشلەتسىڭىز بولىدۇ ',
          buildOption: 'تۈر ھاسىللاش'
        },
        rowProp: {
          colSize: 'قاتار',
          col2: 'قوش قاتار',
          col3: 'ئۈچ قاتار',
          col4: 'تۆت قاتار',
          col6: 'ئالتە قاتار',
          layout: 'قۇرۇلما'
        },
        textProp: {
          name: 'مەزمۇن',
          alignTitle: 'توغرىلاش ئۇسۇلى',
          alignLeft: 'سولغا توغرىلاش',
          alignCenter: 'ئوتتۇرىغا توغرىلاش',
          alignRight: 'ئوڭغا توغرىلاش',
          colorTitle: 'خەت رەڭگى',
          sizeTitle: 'خەت چوڭ كىچىكلىكى',
          boldTitle: 'خەت توملۇقى',
          fontNormal: 'نۇرمال',
          fontBold: 'توم'
        },
        subtableProp: {
          seqTitle: 'تەرتىپ نۇمۇر',
          showSeq: 'تەرتىپ نۇمۇرنى كۆرسىتىش',
          showCheckbox: 'كۆپ تاللاش',
          errSubDrag: 'بالا جەدۋەل بۇ كونتروللىغۇچنى قوللىمايدۇ ،باشقا مۇۋاپىق بولغان كونتروللىغۇچنى ئىشلىتىڭ',
          colPlace: 'كونتروللىغۇچنى تارتىپ ئەكىرىڭ'
        },
        uploadProp: {
          limitFileCount: 'ھۆججەت سانى چېكى',
          limitFileSize: 'ھۆججەت چوڭ-كىچىكلىكى چېكى',
          multiFile: 'كۆپ ھۆججەت چىقىرىشقا بولىدۇ',
          limitImgCount: 'رەسىم سانى چېكى',
          limitImgSize: 'رەسىم چوڭ-كىچىكلىكى چېكى',
          multiImg: 'كۆپ رەسىم چىقىرىشقا بولىدۇ'
        }
      }
    },
    listDesign: {
      fieldSettingTab: 'ئۇچۇر تەڭشەش',
      listSettingTab: 'پارامېتىر تەڭشەش',
      searchTitle: 'تەكشۈرۈش شەرتى',
      listTitle: 'قۇر ئۇچۇرى',
      searchField: 'ئۇچۇر تەكشۈرۈش',
      listField: 'قۇر ئۇچۇرى',
      activeBtn: {
        ActionButtonUpdate: 'تەھرىرلەش',
        ActionButtonDelete: 'ئۆچۈرۈش'
      },
      search: {
        addBtn: 'تەھرىرلەش',
        emptyText: 'ئىزدەش شەرتى بىكىتىلمىدى',
        editPopupTitle: 'تەكشۈرۈش ئۇچۇرىنى تەھرىرلەش'
      },
      searchPopup: {
        colTitle: 'تېما',
        saveBtn: 'ساقلاش'
      }
    },
    text: {
      copySuccess: 'ئۇچۇر نۇسخىلاش تاختىسىغا نۇسخىلاندى',
      copyError: 'نۆۋەتتكى مۇھىت بۇ مەشخۇلاتنى قوللىمايدۇ'
    },
    countdown: {
      formats: {
        yyyy: 'يىل',
        MM: 'ئاي',
        dd: 'كۈن',
        HH: 'سائەت',
        mm: 'مىنۇت',
        ss: 'سېكۇنت'
      }
    },
    plugins: {
      extendCellArea: {
        area: {
          mergeErr: 'بىرىكتۈرۈلگەن قاتارغا بۇ مەشخۇلاتنى قىلىشقا بولمايدۇ',
          multiErr: 'كۆپ تاللاش رايۇنىغا بۇ مەشخۇلاتنى قىلىشقا بولمايدۇ',
          selectErr: '无法操作指定区域的单元格',
          extendErr: 'ئەگەر كىڭىيدىغان-تارىيىدىغا رايۇندا بىرىكتۈرۈلگەن ئۇچۇر بولسا، بارلىق بىرىكتۈرۈلگەن ئۇچۇرلارنىڭ كەڭلىكى ئوخشاش بولىدۇ ',
          pasteMultiErr: 'چاپلاشقا ئامالسىز،ئوخشاش بولغان ئۇچۇر چوڭلۇقىدىكى ئۇچۇرلانىلا چاپلاشقا بولىدۇ ',
          cpInvalidErr: 'سىز تاللىغان رايۇندا چەكلەنگەن قۇر بار （{0}）'
        },
        fnr: {
          title: 'ئىزدەش ۋە ئالماشتۇرۇش',
          findLabel: 'ئىزدەش',
          replaceLabel: 'ئالماشتۇرۇش',
          findTitle: 'مەزمۇن ئىزدەش',
          replaceTitle: 'ئالماشتۇرۇش：',
          tabs: {
            find: 'ئىزدەش',
            replace: 'ئالماشتۇرۇش'
          },
          filter: {
            re: 'لوگىكىلىق شەرىت ئۇسۇلى',
            whole: 'بارلىق سۆز بويىچە ئىزدەش',
            sensitive: 'چوڭ-كىچىكلىكىنى ئايرىش'
          },
          btns: {
            findNext: 'كىينكىنى تەكشۈرۈش',
            findAll: 'ھەممىنى تەكشۈرۈش',
            replace: 'ئالماشتۇرۇش',
            replaceAll: 'ھەممىنى ئالماشتۇرۇش',
            cancel: 'ئەمەلدىن قالدۇرۇش'
          },
          header: {
            seq: '#',
            cell: 'تاق كاتاكچە',
            value: 'قىممىتى'
          },
          body: {
            row: '行：{0}',
            col: '列：{0}'
          },
          empty: '(قۇرۇق)',
          reError: 'ئۈنۇمسىز لوگىكىلىق شەرىت',
          recordCount: 'تىپىلغىنى {0} دانە ئۇچۇر',
          notCell: 'شەرىتكە ئۇيغۇن ئۇچۇر تېپىلمىدى',
          replaceSuccess: 'جەمئىي {0} دانە ئۇچۇر ئالماشتۇرۇلدى'
        }
      },
      filterComplexInput: {
        menus: {
          fixedColumn: 'قۇر توڭلىتىش',
          fixedGroup: 'گۇرۇپپا توڭلىتىش',
          cancelFixed: 'توڭلىتىشنى ئەمەلدىن قالدۇرۇش',
          fixedLeft: 'سول ياندىكىنى توڭلىتىش',
          fixedRight: 'ئوڭ ياندىكىنى توڭلىتىش'
        },
        cases: {
          equal: 'تەڭ',
          gt: 'چوڭ',
          lt: 'كىچىك',
          begin: 'باشلىنىشى',
          endin: 'ئاخىرلىشىشى',
          include: 'ئۆز ئىچىگە ئالىدۇ',
          isSensitive: 'چوڭ-كىچىكلىكىنى ئايرىش'
        }
      },
      filterCombination: {
        menus: {
          clearSort: 'تەرتىپنى تازىلاش',
          sortAsc: 'ئېشىش',
          sortDesc: 'كېمىيىش',
          fixedColumn: 'قۇر توڭلىتىش',
          fixedGroup: 'گۇرۇپپا توڭلىتىش',
          cancelFixed: 'توڭلىتىشنى ئەمەلدىن قالدۇرۇش',
          fixedLeft: 'سول ياندىكىنى توڭلىتىش',
          fixedRight: 'ئوڭ ياندىكىنى توڭلىتىش',
          clearFilter: 'تاسقاشنى تازىلاش',
          textOption: 'تېكىست تاسقاش',
          numberOption: 'سان تاسقاش'
        },
        popup: {
          title: 'ئىختىيارى تاسقاش ئۇسۇلى',
          currColumnTitle: 'نۆۋەتتكى قۇر：',
          and: 'ھەم',
          or: 'ياكى',
          describeHtml: 'ئىشلىتىشكە بولىدۇ ? يەككە ئۇچۇرغا ۋەكىللىك قىلىدۇ<br/>ئىشلىتىش * خالىغان كۆپ ئۇچۇرنى ئىشلىتىشكە ۋەكىللىك قىلىدۇ'
        },
        cases: {
          equal: 'تەڭ',
          unequal: 'تەڭ ئەمەس',
          gt: 'چوڭ',
          ge: 'چوڭ ياكى تەڭ',
          lt: 'كىچىك',
          le: 'كىچىك ياكى تەڭ',
          begin: 'باشلىنىشى',
          notbegin: 'ئاخىرلىشىشى ئەمەس',
          endin: 'ئاخىرلىشىشى',
          notendin: 'ئاخىرلىشىشى ئەمەس',
          include: 'ئۆز ئىچىگە ئالىدۇ',
          exclude: 'ئۆز ئىچىگە ئالمايدۇ',
          between: 'ئارىسىدا',
          custom: 'ئىختىيارى تاسقاش',
          insensitive: 'چوڭ-كىچىكلىكى ئايرىلمايدۇ',
          isSensitive: 'چوڭ-كىچىكلىكى ئايرىلىدۇ'
        },
        empty: '(قۇرۇق)',
        notData: 'ماس ئۇچۇر يوق'
      }
    },
    pro: {
      area: {
        mergeErr: 'بىرىكتۈرۈلگەن كاتاكچىگە بۇ مەشخۇلاتنى قىلىش چەكلىنىدۇ',
        multiErr: 'كۆپ خىل تاللاش رايۇنىغا بۇ مەشخۇلاتنى قىلىش چەكلىنىدۇ',
        extendErr: 'ئەگەر كىڭىيدىغان-تارىيىدىغا رايۇندا بىرىكتۈرۈلگەن ئۇچۇر بولسا، بارلىق بىرىكتۈرۈلگەن ئۇچۇرلارنىڭ كەڭلىكى ئوخشاش بولىدۇ ',
        pasteMultiErr: 'چاپلاشقا ئامالسىز،ئوخشاش بولغان ئۇچۇر چوڭلۇقىدىكى ئۇچۇرلانىلا چاپلاشقا بولىدۇ '
      },
      fnr: {
        title: 'ئىزدەش ۋە ئالماشتۇرۇش',
        findLabel: 'ئىزدەش',
        replaceLabel: 'ئالماشتۇرۇش',
        findTitle: 'مەزمۇن ئىزدەش:',
        replaceTitle: 'ئالماشتۇرۇش：',
        tabs: {
          find: 'ئىزدەش',
          replace: 'ئالماشتۇرۇش'
        },
        filter: {
          re: 'لوگىكىلىق شەرىت ئۇسۇلى',
          whole: 'بارلىق سۆز بويىچە ئىزدەش',
          sensitive: 'چوڭ-كىچىكلىكىنى ئايرىش'
        },
        btns: {
          findNext: 'كىينكىنى تەكشۈرۈش',
          findAll: 'ھەممىنى تەكشۈرۈش',
          replace: 'ئالماشتۇرۇش',
          replaceAll: 'ھەممىنى ئالماشتۇرۇش',
          cancel: 'ئەمەلدىن قالدۇرۇش'
        },
        header: {
          seq: '#',
          cell: 'تاق كاتاكچە',
          value: 'قىممىتى'
        },
        empty: '(قۇرۇق)',
        reError: 'ئۈنۇمسىز لوگىكىلىق شەرىت',
        recordCount: 'تىپىلغىنى {0} دانە ئۇچۇر',
        notCell: 'شەرىتكە ئۇيغۇن ئۇچۇر تېپىلمىدى',
        replaceSuccess: 'جەمئىي {0} دانە ئۇچۇر ئالماشتۇرۇلدى'
      }
    },
    renderer: {
      search: 'ئىزدەش',
      cases: {
        equal: 'تەڭ',
        unequal: 'تەڭ ئەمەس',
        gt: 'چوڭ',
        ge: 'چوڭ ياكى تەڭ',
        lt: 'كىچىك',
        le: 'كىچىك ياكى تەڭ',
        begin: 'باشلىنىشى',
        notbegin: 'ئاخىرلىشىشى ئەمەس',
        endin: 'ئاخىرلىشىشى',
        notendin: 'ئاخىرلىشىشى ئەمەس',
        include: 'ئۆز ئىچىگە ئالىدۇ',
        exclude: 'ئۆز ئىچىگە ئالمايدۇ',
        between: 'ئارىسىدا',
        custom: 'ئىختىيارى تاسقاش',
        insensitive: 'چوڭ-كىچىكلىكى ئايرىلمايدۇ',
        isSensitive: 'چوڭ-كىچىكلىكى ئايرىلىدۇ'
      },
      combination: {
        menus: {
          clearSort: 'تەرتىپنى تازىلاش',
          sortAsc: 'ئېشىش',
          sortDesc: 'كېمىيىش',
          fixedColumn: 'قۇر توڭلىتىش',
          fixedGroup: 'گۇرۇپپا توڭلىتىش',
          cancelFixed: 'توڭلىتىشنى ئەمەلدىن قالدۇرۇش',
          fixedLeft: 'سول ياندىكىنى توڭلىتىش',
          fixedRight: 'ئوڭ ياندىكىنى توڭلىتىش',
          clearFilter: 'تاسقاشنى تازىلاش',
          textOption: 'تېكىست تاسقاش',
          numberOption: 'سان تاسقاش'
        },
        popup: {
          title: 'ئىختىيارى تاسقاش ئۇسۇلى',
          currColumnTitle: 'نۆۋەتتكى قۇر：',
          and: 'ھەم',
          or: 'ياكى',
          describeHtml: 'ئىشلىتىشكە بولىدۇ ? يەككە ئۇچۇرغا ۋەكىللىك قىلىدۇ<br/>ئىشلىتىش * خالىغان كۆپ ئۇچۇرنى ئىشلىتىشكە ۋەكىللىك قىلىدۇ'
        },
        empty: '(قۇرۇق)',
        notData: 'ماس ئۇچۇر يوق'
      }
    }
  }
}
