<template>
  <div>
    <h2>粘性表格 - 功能设计预览</h2>
    <div>重构中...，😄预计 v3.5 发布，敬请期待！</div>
    <p class="tip">
      1、重构内部渲染，降低渲染次数，提升渲染性能<br>
      2、重构树表格，支持虚拟树<br>
      3、修复固定列与单元格不对齐问题<br>
      4、支持多级表头任意合并<br>
      5、支持左侧固定列、右侧固定列、顶部固定行、底部固定行<br>
      6、支持固定列与展开行<br>
      7、支持列宽拖动与行高拖动<br>
      8、支持单元格更多配置化设置<br>
      9、支持行分组<br>
      10、支持更多快捷键操作<br>
      11、支持虚拟滚动与单元格合并<br>
      12、支持虚拟滚动按需加载<br>
      13、支持打印单元格合并与样式<br>
      14、优化数据代理，配置更简单<br>
      15、优化 CRUD 管理器、单元格编辑与数据校验<br>
      16、优化渲染器，更加强大的扩展与复用性<br>
      17、优化虚拟滚动，极致流畅、毫秒级渲染、最大可支持50万行渲染量<br>
    </p>

    <div>
      <img src="../../assets/image/vxe-table.next.gif">
    </div>
    <div>
      <img src="../../assets/image/vxe-table.next.png">
    </div>
  </div>
</template>
